In [1]:
# Numerical Python - numpy 
# Database in Python - DataFrame - Pandas
%pip install numpy pandas matplotlib

Requirement already satisfied: numpy in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (1.26.4)
Requirement already satisfied: pandas in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (2.2.2)
Requirement already satisfied: matplotlib in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (3.9.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/macpc/Library/Python/3.12/lib/python/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas) (2024.1)
Requirement already satisfied: contourpy>=1.0.1 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from matplotlib) (1.3.0)
Requirement already satisfied: cycler>=0.10 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from matplotlib) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from matplotlib) (4.54.1)
Requirement already satisfied: kiwisolver>=1.3.1 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from matplotlib) (1.4.7)
Requirement already satisfied: packaging>=20.0 in /Users/macpc/Library/Python/3.12/lib/python/site-packages (from matplotlib) (24.0)
Requirement already satisfied: pillow>=8 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from matplotlib) (11.0.0)
Requirement already satisfied: pyparsing>=2.3.1 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from matplotlib) (3.2.0)
Requirement already satisfied: six>=1.5 in /Users/macpc/Library/Python/3.12/lib/python/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 23.2.1 -> 25.0.1
[notice] To update, run: python3 -m pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [2]:
import numpy as np 
import pandas as pd
from warnings import filterwarnings
filterwarnings("ignore")

In [3]:

emp = pd.DataFrame(
    {
    "emp_name":[],
    "job_name":[],
    "hire_date":[],
    "salary":[]
    }
)

In [4]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 0 entries
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   emp_name   0 non-null      float64
 1   job_name   0 non-null      float64
 2   hire_date  0 non-null      float64
 3   salary     0 non-null      float64
dtypes: float64(4)
memory usage: 132.0 bytes

In [5]:
emp = emp.add(
    {
        "emp_name":["Avi",],
        "job_name":["Trainer",],
        "hire_date":["2024-02-20",],
        "salary":[120000,]
        
    }
)

In [6]:
emp

Empty DataFrame
Columns: [emp_name, job_name, hire_date, salary]
Index: []

In [7]:
data  =    {
    "emp_name":["Avi"],
    "job_name":["Trainer"],
    "hire_date":["2024-02-20"],
    "salary":[120000]
    }

In [8]:
data["emp_name"]

['Avi']

In [9]:
emp = pd.DataFrame(data)

In [10]:
emp

  emp_name job_name   hire_date  salary
0      Avi  Trainer  2024-02-20  120000

In [11]:
data["emp_name"].append("Krishan")
data["hire_date"].append(None)
data["job_name"].append(None)
data["salary"].append(None)

In [12]:
emp = pd.DataFrame(data)

In [13]:
emp

  emp_name job_name   hire_date    salary
0      Avi  Trainer  2024-02-20  120000.0
1  Krishan     None        None       NaN

In [14]:
data["emp_name"].extend(["Hussain","mufid","parth"])
data["job_name"].extend(["Data Analyst","Data Analyst","Data Analyst"])
data["hire_date"].extend(["2025-01-05","2025-01-08","2025-01-28"])
data["salary"].extend([40000,35000,60000])
data

{'emp_name': ['Avi', 'Krishan', 'Hussain', 'mufid', 'parth'],
 'job_name': ['Trainer', None, 'Data Analyst', 'Data Analyst', 'Data Analyst'],
 'hire_date': ['2024-02-20', None, '2025-01-05', '2025-01-08', '2025-01-28'],
 'salary': [120000, None, 40000, 35000, 60000]}

In [15]:
emp = pd.DataFrame(data)

In [16]:
#select * from emp
emp

  emp_name      job_name   hire_date    salary
0      Avi       Trainer  2024-02-20  120000.0
1  Krishan          None        None       NaN
2  Hussain  Data Analyst  2025-01-05   40000.0
3    mufid  Data Analyst  2025-01-08   35000.0
4    parth  Data Analyst  2025-01-28   60000.0

In [17]:
# select emp_name from emp
emp["emp_name"]

0        Avi
1    Krishan
2    Hussain
3      mufid
4      parth
Name: emp_name, dtype: object

In [18]:
# select emp_name, salary from emp
emp[["emp_name","salary"]]

  emp_name    salary
0      Avi  120000.0
1  Krishan       NaN
2  Hussain   40000.0
3    mufid   35000.0
4    parth   60000.0

In [19]:
# describe emp
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   emp_name   5 non-null      object
 1   job_name   4 non-null      object
 2   hire_date  4 non-null      object
 3   salary     4 non-null      float64
dtypes: float64(1), object(3)
memory usage: 292.0+ bytes

In [20]:
emp["salary"].dtype

dtype('float64')

In [21]:
emp["salary"] = emp["salary"].astype("int64")

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer

In [22]:
# select * from emp where emp is null
emp.isnull()

   emp_name  job_name  hire_date  salary
0     False     False      False   False
1     False      True       True    True
2     False     False      False   False
3     False     False      False   False
4     False     False      False   False

In [23]:
# select * from emp where salary is null
emp[emp["salary"].isnull()]

  emp_name job_name hire_date  salary
1  Krishan     None      None     NaN

In [25]:
emp.dropna(axis=0,inplace=True)

In [26]:
emp

  emp_name      job_name   hire_date    salary
0      Avi       Trainer  2024-02-20  120000.0
2  Hussain  Data Analyst  2025-01-05   40000.0
3    mufid  Data Analyst  2025-01-08   35000.0
4    parth  Data Analyst  2025-01-28   60000.0

In [28]:
emp.reset_index(drop=True)

  emp_name      job_name   hire_date    salary
0      Avi       Trainer  2024-02-20  120000.0
1  Hussain  Data Analyst  2025-01-05   40000.0
2    mufid  Data Analyst  2025-01-08   35000.0
3    parth  Data Analyst  2025-01-28   60000.0